
#**Here, my friend, is some simple example of basic SQL query with magic**   

This is a practice of some basic SQL commands on BigQuey with magic in jupyter notebook.

In [0]:
# in colab

from google.colab import auth

auth.authenticate_user()
print('Authenticated')

Authenticated

## Exploring dataset and tables

In [0]:
%%bigquery --project sql-python

SELECT
 * EXCEPT(schema_owner)
FROM
 INFORMATION_SCHEMA.SCHEMATA

In [0]:
%%bigquery --project sql-python

SELECT
  * EXCEPT(is_typed)
FROM
  kaggle_fifa19.INFORMATION_SCHEMA.TABLES

In [0]:
%%bigquery --project sql-python

SELECT
  * EXCEPT(is_generated, generation_expression, is_stored, is_updatable)
FROM
  kaggle_fifa19.INFORMATION_SCHEMA.COLUMNS
WHERE
  table_name="data19_3"

In [0]:
%%bigquery --project sql-python

SELECT
  *
FROM
  kaggle_fifa19.INFORMATION_SCHEMA.COLUMN_FIELD_PATHS
WHERE
  table_name="data19_3"
  AND column_name='Position'

advanced example
https://cloud.google.com/bigquery/docs/information-schema-tables

In [0]:
%%bigquery --project sql-python

SELECT
  * EXCEPT(is_generated, generation_expression, is_stored, is_updatable)
FROM
  kaggle_fifa19.INFORMATION_SCHEMA.COLUMNS
WHERE
  table_name="data19_basic"

In [0]:
%%bigquery --project sql-python

SELECT *
FROM kaggle_fifa19.data19_3
ORDER BY ListID
LIMIT 10

       ID               Name  Age  ...    Wage_EUR_ Release_Clause_EUR_ ListID
0  158023           L. Messi   31  ...  565000000.0         226500000.0      1
1   20801  Cristiano Ronaldo   33  ...  405000000.0         127100000.0      2
2  190871          Neymar Jr   26  ...  290000000.0         228100000.0      3
3  193080             De Gea   27  ...  260000000.0         138600000.0      4
4  192985       K. De Bruyne   27  ...  355000000.0         196400000.0      5
5  183277          E. Hazard   27  ...  340000000.0         172100000.0      6
6  177003          L. Modrić   32  ...  420000000.0         137400000.0      7
7  176580          L. Suárez   31  ...  455000000.0         164000000.0      8
8  155862       Sergio Ramos   32  ...  380000000.0         104600000.0      9
9  200389           J. Oblak   25  ...   94000000.0         144500000.0     10

[10 rows x 16 columns]

## Creating an empty table

In [0]:
%%bigquery --project sql-python

CREATE TABLE IF NOT EXISTS kaggle_fifa19.data19_bio (
  ID  INT64,
  Height INT64,
  Weight INT64
)
OPTIONS(
   expiration_timestamp=TIMESTAMP "2020-12-01 00:00:00 UTC",
   description="Table for inner join",
   labels=[("org_unit", "development")]
 )

Empty DataFrame
Columns: []
Index: []

## Adding columns by replacing table
No add column DDL in BQ

In [0]:
%%bigquery --project sql-python
CREATE OR REPLACE TABLE kaggle_fifa19.data19_bio (
  ID  INT64,
  Name STRING,
  Age INT64,
  Height INT64,
  Weight INT64
);

ALTER TABLE IF EXISTS kaggle_fifa19.data19_bio
SET OPTIONS(description="Table for inner join")

Empty DataFrame
Columns: []
Index: []

## Inserting and updating data manually

In [0]:
%%bigquery --project sql-python

INSERT kaggle_fifa19.data19_bio (ID, Name, Height, Weight, Age)
VALUES(158023, "L. Messi", 170, 72, 31),
      (20801,	"Cristiano Ronaldo", 188, 83, 33);

UPDATE kaggle_fifa19.data19_bio
SET Name="C. Ronaldo"
WHERE Name like '%Ronaldo%';

SELECT *
FROM kaggle_fifa19.data19_bio

       ID        Name  Age  Height  Weight
0  158023    L. Messi   31     170      72
1   20801  C. Ronaldo   33     188      83

In [0]:
%%bigquery --project sql-python

DELETE kaggle_fifa19.data19_bio
WHERE ID=20801;

SELECT *
FROM kaggle_fifa19.data19_bio

       ID      Name  Age  Height  Weight
0  158023  L. Messi   31     170      72

## Inserting data by copying from another table

In [0]:
%%bigquery --project sql-python

INSERT INTO kaggle_fifa19.data19_bio#(ID, Name, Age, Height, Weight)

SELECT ID, Name, Age, Height_CM_, Weight_KG_
FROM kaggle_fifa19.data19_3
ORDER BY ListID
LIMIT 99 OFFSET 1;

SELECT *
FROM kaggle_fifa19.data19_bio

        ID             Name  Age  Height  Weight
0   158023         L. Messi   31     170      72
1   188545   R. Lewandowski   29     183      80
2   189511  Sergio Busquets   29     188      76
3   202652      R. Sterling   23     170      69
4   193747             Koke   26     175      74
..     ...              ...  ...     ...     ...
95  162835    S. Handanovič   33     193      92
96  192387      C. Immobile   28     185      85
97  200389         J. Oblak   25     188      87
98  181872         A. Vidal   31     180      75
99  208421             Saúl   23     183      77

[100 rows x 5 columns]

## Replace existing table by copying data from another table 
and create Rank column from Wage, Vaule, and ID

In [0]:
%%bigquery --project sql-python
CREATE OR REPLACE TABLE kaggle_fifa19.data19_basic
 OPTIONS(
   description="Top players basic info"
 ) AS
SELECT
  ID, Name, Nationality, Club, Age, ListID
FROM kaggle_fifa19.data19_3
ORDER BY ListID
LIMIT 100;

SELECT *
FROM kaggle_fifa19.data19_basic

        ID               Name  ... Age ListID
0   158023           L. Messi  ...  31      1
1    20801  Cristiano Ronaldo  ...  33      2
2   190871          Neymar Jr  ...  26      3
3   193080             De Gea  ...  27      4
4   192985       K. De Bruyne  ...  27      5
..     ...                ...  ...  ..    ...
95  183907         J. Boateng  ...  29     96
96  181872           A. Vidal  ...  31     97
97  181458         I. Perišić  ...  29     98
98  180930           E. Džeko  ...  32     99
99  179846         S. Khedira  ...  31    100

[100 rows x 6 columns]

## Creating a new table by copying data from another table 

you can **rename** a table by copying it and droping the old one in BQ

In [0]:
%%bigquery --project sql-python
CREATE OR REPLACE TABLE kaggle_fifa19.data19_value   # same as replacing a table
 OPTIONS(
   description="Top players value info"
 ) AS
SELECT ID, Name, Value_EUR_, Wage_EUR_
FROM kaggle_fifa19.data19_3
ORDER BY ListID
LIMIT 100;

SELECT *
FROM kaggle_fifa19.data19_value

        ID               Name   Value_EUR_    Wage_EUR_
0   158023           L. Messi  110500000.0  565000000.0
1    20801  Cristiano Ronaldo   77000000.0  405000000.0
2   190871          Neymar Jr  118500000.0  290000000.0
3   193080             De Gea   72000000.0  260000000.0
4   192985       K. De Bruyne  102000000.0  355000000.0
..     ...                ...          ...          ...
95  183907         J. Boateng   30000000.0  115000000.0
96  181872           A. Vidal   26000000.0  205000000.0
97  181458         I. Perišić   37500000.0  110000000.0
98  180930           E. Džeko   30500000.0  115000000.0
99  179846         S. Khedira   33000000.0  160000000.0

[100 rows x 4 columns]

## Display columns of all new created/updated tables

In [0]:
%%bigquery --project sql-python

SELECT
  * EXCEPT(is_generated, generation_expression, is_stored, is_updatable)
FROM
  kaggle_fifa19.INFORMATION_SCHEMA.COLUMNS
WHERE
  table_name="data19_basic" or table_name="data19_bio" or table_name="data19_value"



## Join tables
In BQ no primary key nor foreign key needed

In [0]:
%%bigquery --project sql-python
CREATE OR REPLACE TABLE kaggle_fifa19.data19_new
AS
SELECT 
data19_basic.ListID, data19_basic.ID, data19_basic.Name, data19_basic.Nationality, data19_basic.Club, 
data19_bio.Height, data19_bio.Weight, 
data19_value.Value_EUR_,  data19_value.Wage_EUR_
FROM kaggle_fifa19.data19_basic INNER JOIN kaggle_fifa19.data19_bio USING (ID)  INNER JOIN kaggle_fifa19.data19_value USING (ID)
ORDER BY ListID;

In [0]:
%%bigquery --project sql-python df

SELECT * FROM kaggle_fifa19.data19_new ORDER BY ListID

In [0]:
df

    ListID      ID               Name  ... Weight   Value_EUR_    Wage_EUR_
0        1  158023           L. Messi  ...     72  110500000.0  565000000.0
1        2   20801  Cristiano Ronaldo  ...     83   77000000.0  405000000.0
2        3  190871          Neymar Jr  ...     68  118500000.0  290000000.0
3        4  193080             De Gea  ...     76   72000000.0  260000000.0
4        5  192985       K. De Bruyne  ...     70  102000000.0  355000000.0
..     ...     ...                ...  ...    ...          ...          ...
95      96  183907         J. Boateng  ...     90   30000000.0  115000000.0
96      97  181872           A. Vidal  ...     75   26000000.0  205000000.0
97      98  181458         I. Perišić  ...     80   37500000.0  110000000.0
98      99  180930           E. Džeko  ...     84   30500000.0  115000000.0
99     100  179846         S. Khedira  ...     90   33000000.0  160000000.0

[100 rows x 9 columns]

## Exporting data 
1. save dataframe on disk
2. use Dataflow https://cloud.google.com/dataflow/docs

## Dropping a table

In [0]:
%%bigquery --project sql-python

DROP TABLE IF EXISTS kaggle_fifa19.data19_1

Empty DataFrame
Columns: []
Index: []

## **Reference**

getting started colab bq https://colab.research.google.com/notebooks/bigquery.ipynb

quick setup colab bq 
https://tech.aaronteoh.com/bigquery-colaboratory-basics/

dataset and table metadata
https://cloud.google.com/bigquery/docs/information-schema-tables

DML syntax https://cloud.google.com/bigquery/docs/reference/standard-sql/dml-syntax

standard SQL query syntax https://cloud.google.com/bigquery/docs/reference/standard-sql/query-syntax

w3schools SQL tutorial https://www.w3schools.com/sql/default.asp